wiki/no-linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-16 Wed 21:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>No Linux? | UC Linux Wiki</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">No Linux? | UC Linux Wiki</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgde8ed4b">UC Resources</a>
<ul>
<li><a href="#org6bca3fc">Vmware horizon client</a></li>
</ul>
</li>
<li><a href="#orgab3f0fe">Do it yourself</a>
<ul>
<li><a href="#org39061be">Virtual Box</a>
<ul>
<li><a href="#org498d421">Tips</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
What to do if your professor doesn't support Linux. You need some apps that doesn't run on Linux.
</p>

<p>
You can run windows temporarily to solve your problems even with your Linux Laptop in the following ways.
</p>

<div id="outline-container-orgde8ed4b" class="outline-2">
<h2 id="orgde8ed4b">UC Resources</h2>
<div class="outline-text-2" id="text-orgde8ed4b">
</div>
<div id="outline-container-org6bca3fc" class="outline-3">
<h3 id="org6bca3fc">Vmware horizon client</h3>
<div class="outline-text-3" id="text-org6bca3fc">
<p>
Link: <a href="https://mydesk.uc.edu/">https://mydesk.uc.edu/</a>
</p>

<p>
UC provides support for virtual desktops with Windows and preinstalled programs.
</p>

<p>
You can install the client program and log in with your 6+2.
</p>

<p>
Note that you cannot install programs and be sure to save anything important in the cloud so that you won't lose your files.
</p>

<p>
I haven't used the web version so can't tell you about that but the vmware-horizon-client works well in my Arch Linux.
</p>
</div>
</div>
</div>

<div id="outline-container-orgab3f0fe" class="outline-2">
<h2 id="orgab3f0fe">Do it yourself</h2>
<div class="outline-text-2" id="text-orgab3f0fe">
</div>
<div id="outline-container-org39061be" class="outline-3">
<h3 id="org39061be">Virtual Box</h3>
<div class="outline-text-3" id="text-org39061be">
<p>
Link: <a href="https://www.virtualbox.org/wiki/Downloads">https://www.virtualbox.org/wiki/Downloads</a>
</p>

<p>
If you need more control over what program to install and such, you can use this. Note that you'll be installing a virtual Windows in your computer so make sure you have enough resources. And willing to spend time coz windows install takes time. Don't try this just before your deadline coz you need some windows only program.
</p>
</div>

<div id="outline-container-org498d421" class="outline-4">
<h4 id="org498d421">Tips</h4>
<div class="outline-text-4" id="text-org498d421">
<ul class="org-ul">
<li>Give sufficient RAM for the virtual computer, but not too much as it'll freeze your computer.</li>
<li>Freeze the state instead of poweroff like in windows if you don't want updates. Imaging opening windows for just half an hour but waiting 1 hour for updates.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-11-16 Wed 21:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
